---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetBasicIEnumerator
source: html/f64b5fd8-aa58-7785-c3e6-9d99283eb8cc.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.